---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionsForHooksEnabled
source: html/56d152fc-1a18-fb0b-f167-873fd7edd05a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionsForHooksEnabled Property

"Hook Angles"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeAngularDimensionsForHooksEnabled { get; }
```